TOKEN = '6261824102:AAHWd67fP3YoJJIqJ6_vDDgWE-Hr3dSI9Fw'

CNANNELS = [
    ['КАНАЛ 1','@nmntzh','https://t.me/nmntzh'],
    ['КАНАЛ 2','@ndsgne','https://t.me/ndsgne']
]

admin_ids = [
    5455171373,
    387161594

]

NOT_SUB_MESSAGE = 'Для доступа к боту, необходимо подписаться на следующие каналы'
SORRY = 'Извините, но на данный момент бот выключен по техническим моментам'

REF_TEXT = '''🔹 Реферальная программа

Получайте {count} запросов за приглашенного пользователя.

👥 Приглашено пользователей: {users}
🔶 У вас : {count2} запросов



🔗 Моя реферальная ссылка:\n{url}
'''

REF_ADMIN = '''🔹 Настройки реферальной программы

Сервис: {service}
Бонус за приглашенного: {count}
'''


howMuchOstatok = '''🎧 Ваш текст озвучен!

У вас осталось: {} запросов на сегодня.

🔹 Если запросы закончатся, вы можете:
- Пригласите друзей и получите бонусы: /refs
- Пополните баланс символов: /buy

⚙️ Изменить голос: /set_voice'''